; domain
(define (domain blocksworld-domain)
 (:requirements :strips :typing :constraints :action-costs)
 (:types block)
 (:predicates (clear ?obj - block) (ontable ?obj - block) (handempty) (holding ?obj - block) (on ?obj1 - block ?obj2 - block))
 (:functions (total-cost))
 (:action pickup
  :parameters ( ?obj - block)
  :precondition (and (clear ?obj) (ontable ?obj) (handempty))
  :effect (and (holding ?obj) (not (clear ?obj)) (not (ontable ?obj)) (not (handempty)) (increase (total-cost) 1)))
 (:action putdown
  :parameters ( ?obj - block)
  :precondition (and (holding ?obj))
  :effect (and (clear ?obj) (handempty) (ontable ?obj) (not (holding ?obj)) (increase (total-cost) 1)))
 (:action stack
  :parameters ( ?obj - block ?underobj - block)
  :precondition (and (clear ?underobj) (holding ?obj))
  :effect (and (handempty) (clear ?obj) (on ?obj ?underobj) (not (clear ?underobj)) (not (holding ?obj)) (increase (total-cost) 1)))
 (:action unstack
  :parameters ( ?obj - block ?underobj - block)
  :precondition (and (on ?obj ?underobj) (clear ?obj) (handempty))
  :effect (and (holding ?obj) (clear ?underobj) (not (on ?obj ?underobj)) (not (clear ?obj)) (not (handempty)) (increase (total-cost) 1)))
)

; problem
(define (problem blocksworld-problem)
 (:domain blocksworld-domain)
 (:objects
   yellow_block_1 black_block_1 grey_block_1 grey_block_2 white_block_1 yellow_block_2 blue_block_1 - block
 )
 (:init (ontable yellow_block_1) (ontable black_block_1) (ontable grey_block_1) (on grey_block_2 grey_block_1) (on white_block_1 yellow_block_1) (ontable yellow_block_2) (ontable blue_block_1) (clear black_block_1) (clear grey_block_2) (clear white_block_1) (clear yellow_block_2) (clear blue_block_1) (handempty) (= (total-cost) 0))
 (:goal (and (on blue_block_1 yellow_block_2)))
 (:constraints (sometime (and (holding grey_block_1) (on blue_block_1 black_block_1))) (sometime (clear grey_block_1)) (sometime (or (on grey_block_1 white_block_1) (clear yellow_block_1))))
 (:metric minimize (total-cost))
)

; plan
1. (pickup blue_block_1)
   deleted: (clear blue_block_1) (ontable blue_block_1) (handempty)
   added: (holding blue_block_1)
   goals met: 0 of 1
2. (stack blue_block_1 black_block_1)
   deleted: (clear black_block_1) (holding blue_block_1)
   added: (handempty) (clear blue_block_1) (on blue_block_1 black_block_1)
   goals met: 0 of 1
3. (unstack grey_block_2 grey_block_1)
   deleted: (on grey_block_2 grey_block_1) (clear grey_block_2) (handempty)
   added: (holding grey_block_2) (clear grey_block_1)
   goals met: 0 of 1
4. (putdown grey_block_2)
   deleted: (holding grey_block_2)
   added: (clear grey_block_2) (handempty) (ontable grey_block_2)
   goals met: 0 of 1
5. (pickup grey_block_1)
   deleted: (clear grey_block_1) (ontable grey_block_1) (handempty)
   added: (holding grey_block_1)
   goals met: 0 of 1
6. (stack grey_block_1 white_block_1)
   deleted: (clear white_block_1) (holding grey_block_1)
   added: (handempty) (clear grey_block_1) (on grey_block_1 white_block_1)
   goals met: 0 of 1
7. (unstack blue_block_1 black_block_1)
   deleted: (on blue_block_1 black_block_1) (clear blue_block_1) (handempty)
   added: (holding blue_block_1) (clear black_block_1)
   goals met: 0 of 1
8. (stack blue_block_1 yellow_block_2)
   deleted: (clear yellow_block_2) (holding blue_block_1)
   added: (handempty) (clear blue_block_1) (on blue_block_1 yellow_block_2)
   goals met: 1 of 1
